This file is for pandas :')

In [1]:
import pandas as pd

In [ ]:
data = {
    'House_ID': [101, 102, 103, 104, 105],
    'Location': ['New York', 'San Francisco', 'Austin', 'Seattle', 'Chicago'],
    'Price': [850000, 1250000, 420000, 680000, 520000],
    'Bedrooms': [3, 4, 2, 3, 3],
    'Bathrooms': [2, 3, 2, 2, 1],
    'Square_Feet': [1500, 2300, 1100, 1600, 1400],
    'Year_Built': [2005, 2010, 1998, 2003, 2000],
    'Garage': [1, 2, 1, 1, 0]
}

pd.DataFrame(data)# this is used for creating a table

,House_ID,Location,Price,Bedrooms,Bathrooms,Square_Feet,Year_Built,Garage
0,101,New York,850000,3,2,1500,2005,1
1,102,San Francisco,1250000,4,3,2300,2010,2
2,103,Austin,420000,2,2,1100,1998,1
3,104,Seattle,680000,3,2,1600,2003,1
4,105,Chicago,520000,3,1,1400,2000,0

In [ ]:
pd.Series([1,20,100,4,5])

#index                     values
#dataType

0      1
1     20
2    100
3      4
4      5
dtype: int64

In [7]:
housing = pd.read_csv("House_Rent_Dataset.csv")
housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4746 entries, 0 to 4745
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Posted On          4746 non-null   object
 1   BHK                4746 non-null   int64
 2   Rent               4746 non-null   int64
 3   Size               4746 non-null   int64
 4   Floor              4746 non-null   object
 5   Area Type          4746 non-null   object
 6   Area Locality      4746 non-null   object
 7   City               4746 non-null   object
 8   Furnishing Status  4746 non-null   object
 9   Tenant Preferred   4746 non-null   object
 10  Bathroom           4746 non-null   int64
 11  Point of Contact   4746 non-null   object
dtypes: int64(4), object(8)
memory usage: 445.1+ KB

In [8]:
housing.describe()

               BHK          Rent         Size     Bathroom
count  4746.000000  4.746000e+03  4746.000000  4746.000000
mean      2.083860  3.499345e+04   967.490729     1.965866
std       0.832256  7.810641e+04   634.202328     0.884532
min       1.000000  1.200000e+03    10.000000     1.000000
25%       2.000000  1.000000e+04   550.000000     1.000000
50%       2.000000  1.600000e+04   850.000000     2.000000
75%       3.000000  3.300000e+04  1200.000000     2.000000
max       6.000000  3.500000e+06  8000.000000    10.000000